---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.ConstrainedToWallError
source: html/4814ad5a-cf10-c3a4-b4e8-acf895fe2468.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.ConstrainedToWallError Property

Sketch Lines created with Pick Wall must remain parallel to the Wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId ConstrainedToWallError { get; }
```